app/views/users/index.html.erb

<p>Area riservata amministratori</p>
<% @users = User.all %>
---
SELECT `users`.* FROM `users`