app/controllers/cat_libris_controller.rb

SELECT `cat_libris`.* FROM `cat_libris`
---
  def index
    @cat_libris = CatLibri.all

INSERT INTO `cat_libris` (`nome`, `descrizione`, `created_at`, `updated_at`) VALUES ('cat1', 'categoria1', '2018-04-14 17:42:44', '2018-04-14 17:42:44')
---
  def create
    @cat_libri = CatLibri.new(cat_libri_params)

    respond_to do |format|
      if @cat_libri.save

SELECT  `cat_libris`.* FROM `cat_libris` WHERE `cat_libris`.`id` = 1 LIMIT 1
---
    def set_cat_libri
      @cat_libri = CatLibri.find(params[:id])