app/controllers/corsis_controller.rb

  def index
    @corsis = Corsi.all
---
SELECT `corsis`.* FROM `corsis`

  def getattached
    @corsi = Corsi.find(params[:id])
---
SELECT  `corsis`.* FROM `corsis` WHERE `corsis`.`id` = 1 LIMIT 1

  def create
    @corsi = Corsi.new(corsi_params)

    respond_to do |format|
      if @corsi.save
---
INSERT INTO `corsis` (`luogo`, `titolo`, `contatto`, `descrizione`, `data`, `created_at`, `updated_at`) VALUES ('gfdsgfdsg', 'gfdsgfd', 'gfdsgfds', 'gfdsgfds', '2018-04-09', '2018-04-09 17:09:42', '2018-04-09 17:09:42')

  def update
    respond_to do |format|
      if @corsi.update(corsi_params)
---
UPDATE `corsis` SET `image_file_name` = 'SC_compito_17-6-11_(1).pdf', `image_content_type` = 'application/pdf', `image_file_size` = 26536, `image_updated_at` = '2018-04-13 00:08:00', `updated_at` = '2018-04-13 00:08:00' WHERE `corsis`.`id` = 2

  def destroy
    @corsi.destroy
---
DELETE FROM `corsis` WHERE `corsis`.`id` = 4

    def set_corsi
      @corsi = Corsi.find(params[:id])
---
SELECT  "corsis".* FROM "corsis" WHERE "corsis"."id" = ? LIMIT 1  [["id", 1]]