app/controllers/libris_controller.rb

  def index
    @libris = Libri.all
---
SELECT `libris`.* FROM `libris`

  def create
    @libri = Libri.new(libri_params)

    respond_to do |format|
      if @libri.save
---
INSERT INTO `libris` (`titolo`, `prezzo`, `autore`, `descrizione`, `cat`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `secondimage_file_name`, `secondimage_content_type`, `secondimage_file_size`, `secondimage_updated_at`, `created_at`, `updated_at`) VALUES ('boh', 32.0, 'fdsa', 'fdsa', 1, 'Schermata_del_2017-05-24_01-51-19.png', 'image/png', 271341, '2018-04-13 00:25:01', 'Esercizi_D_var_(1).pdf', 'application/pdf', 61158, '2018-04-13 00:25:01', '2018-04-13 00:25:01', '2018-04-13 00:25:01')

  def getfirstattached
    @libri = Libri.find(params[:id])
---
SELECT  `libris`.* FROM `libris` WHERE `libris`.`id` = 1 LIMIT 1

  def getsecondattached
    @libri = Libri.find(params[:id])
---
SELECT  `libris`.* FROM `libris` WHERE `libris`.`id` = 1 LIMIT 1

  def update
    respond_to do |format|
      if @libri.update(libri_params)
---
UPDATE `libris` SET `cat` = 2, `image_file_name` = '3_immagine_Homepage_ISA.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 82459, `image_updated_at` = '2018-05-07 00:16:17', `updated_at` = '2018-05-07 00:16:17' WHERE `libris`.`id` = 6

  def destroy
    @libri.destroy
---
DELETE FROM "libris" WHERE "libris"."id" = ?  [["id", 1]]

    def set_libri
      @libri = Libri.find(params[:id])
---
SELECT  "libris".* FROM "libris" WHERE "libris"."id" = ? LIMIT 1  [["id", 1]]