app/controllers/seminaris_controller.rb

  def index
    @seminaris = Seminari.all
---
SELECT `seminaris`.* FROM `seminaris`

  def getattached
    @seminari = Seminari.find(params[:id])
---
SELECT  `seminaris`.* FROM `seminaris` WHERE `seminaris`.`id` = 1 LIMIT 1

  def create
    @seminari = Seminari.new(seminari_params)

    respond_to do |format|
      if @seminari.save
---
INSERT INTO `seminaris` (`luogo`, `nazione`, `titolo`, `descrizione`, `da`, `al`, `created_at`, `updated_at`) VALUES ('Cento', 'Italia', 'Titolo Seminario', 'Descrizione seminario', '2018-04-17', '2018-04-17', '2018-04-17 06:21:11', '2018-04-17 06:21:11')

  def update
    respond_to do |format|
      if @seminari.update(seminari_params)
---
UPDATE `seminaris` SET `image_file_name` = 'Schermata_del_2017-05-24_01-51-19.png', `image_content_type` = 'image/png', `image_file_size` = 271341, `image_updated_at` = '2018-04-12 23:41:19', `updated_at` = '2018-04-12 23:41:20' WHERE `seminaris`.`id` = 1

    def set_seminari
      @seminari = Seminari.find(params[:id])
---
SELECT  "seminaris".* FROM "seminaris" WHERE "seminaris"."id" = ? LIMIT 1  [["id", 1]]