app/controllers/users_controller.rb

    def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5  ORDER BY `users`.`id` ASC LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2